<template>
  <div class="container px-[20px]">
    <h1 class="text-[30px] font-bold pb-[10px]">Біздің интернет магазин туралы жалпы ақпарат</h1>
    <p class="leading-[2] pb-[10px]">
      Қазақстандық интернет-дүкен-қазақстандық трикотаждың жетекші
      өндірушілерінің өнімдері жиналған бірегей сауда алаңы. 10 жылдан астам
      уақыт бойы біз нарықтағы жағдайды мұқият қадағалап келеміз және сәнді
      әйелдер киімін шығаратын бірде-бір лайықты фирманы назардан тыс
      қалдырмаймыз. Егер назар аударуға лайық жаңа қазақстандық бренд пайда
      болса, оның өнімдерін біздің каталогтан табасыз!
    </p>
    <img width="100%" src="https://bellavka.kz/img/other/hist.jpg" alt=""  class="pb-[10px]"/>
    <p class="pt-[10px] leading-[2]">
      Барлығы қалай басталды? Өздеріңіз білетіндей, Орал-Қазақстандағы сән
      орталықтарының бірі және мыңдаған көтерме сатып алушылар әйелдер киімін
      көтерме сатып алуға келетін орын. Көйлектер мен костюмдерді, юбкалар мен
      шалбарларды, секіргіштер мен блузкаларды, сондай-ақ сыртқы киімдер мен
      аксессуарларды осы жерде өз саласының нағыз мамандары жасайды. Оралдағы
      Әйелдер киімі бірінші онжылдықта сапа мен талғампаздықтың нақты стандарты
      болып табылмайды, оны іскер әйелдер мен ғылыми зиялы қауым, оқытушылар мен
      басшылар, кеңсе қызметкерлері мен шығармашылық тұлғалар, Қазақстандағы,
      Ресейдегі, Беларуссиядағы және басқа елдердегі сәнгер-студенттер таңдайды.
      <br class="pt-[10px]" /> 
      <br />
      Қазақстанда және одан тыс жерлерде миллиондаған әйелдер қазақстандық
      трикотаж сатып алуды армандайды, сондықтан оларға неге көмектеспеске? 2010
      жылы әйелдер киімінің интернет-дүкенін құру туралы шешім қабылданды,
      сондықтан кез-келген Сатып алушы, оның тұрғылықты жеріне қарамастан,
      Қазақстаннан әйелдер киімінің шексіз және әдемі әлемін таба алады.
      <br class="pt-[20px]" />
      Қазақстандық сәннің жүрегінде бола отырып, "ROSI" интернет-дүкені 10
      жылдан астам уақыт бойы әрбір әйел одан да әсерлі, айқын, жарқын көрінуі
      үшін қолдан келгеннің бәрін жасап келеді. Интернеттегі Әйелдер киімі-бұл
      сіздің гардеробыңызды толықтырудың ең ыңғайлы және жағымды тәсілі! Біздің
      акцияларымыз бен сатылымдарымызды бақылай отырып, сіз әрқашан тартымды
      бағамен ерекше нәрсе таба аласыз.
    </p>
    <h1 class="text-[20px] font-bold pt-[30px] pb-[10px]">Сервистер</h1>
    <p class="leading-[2]">
      "ROSI" интернет-дүкені сатып алуды оңай әрі ыңғайлы ету үшін бәрін
      жасайды! Әрбір клиент біздің назарымызды және шынайы қамқорлығымызды
      сезінуі үшін біз өз қызметімізді ұсақ-түйекке дейін ойластырдық. Сайттағы
      навигация жүйесі сіз тауарларды оңай сүзіп, қажетті санаттар мен
      мөлшердегі қазақстандық трикотажды сатып ала алатындай етіп жасалған.
      Сізге тек таңдау керек! Қалғанын дүкен қызметкерлері шешеді! <br />
      Біз онлайн киім сатып алу кезінде барынша ыңғайлылық пен жайлылықты
      қамтамасыз етуге тырысамыз. Біздің сүзгілер санат, өлшем, түс және басқа
      параметрлер бойынша қажетті заттарды жылдам табуға мүмкіндік береді.
      Өнімнің әр бетінде егжей-тегжейлі сипаттамалар, жоғары сапалы фотосуреттер
      және қоймадағы қол жетімділік туралы ақпарат бар. Біз сондай-ақ әртүрлі
      төлем опцияларын және жылдам жеткізуді ұсынамыз, осылайша сіз сатып
      алуларыңызды еш қиындықсыз тамашалай аласыз. <br />
    </p>
    <P class="text-[20px] font-bold pt-[20px]"
      >Міне, сатып алушылардың жаңа сатып алулар үшін Беллавкаға қайта-қайта
      оралуының алты негізгі себебі:</P
    >
    <ul class="max-w space-y-1 list-disc list-inside pt-[20px]">
      <li class="pt-[10px]">
        Қазақстаннан келген клиенттер үшін - курьерлік жеткізу 4000-нан астам
        елді мекенді қамтиды;
      </li>
      <li class="pt-[10px]">
        25 тауар бірлігінен сатып алатын клиенттер үшін біз кез келген көлік
        компаниясымен Ресей мен Қазақстанға тегін жеткізуді ұйымдастырамыз;
      </li>
      <li class="pt-[10px]">
        дүкеннің call-орталығы клиенттердің сұрақтарына жедел жауап береді;
      </li>
      <li class="pt-[10px]">
        біз толық фото-ақпаратты ұсынамыз және барлық көтерме клиенттер мен
        бірлескен сатып алуды Ұйымдастырушыларға кәсіби кеңес береміз;
      </li>
      <li class="pt-[10px]">
        ROSI өзіндік Outlet бөлімі бар, онда сіз тауарларды өзіндік құнынан
        төмен сатып ала аласыз;
      </li>
      <li class="pt-[10px]">
        біз апта сайын жеткізушілермен бірлескен акциялар өткіземіз және сатып
        алушыларымызға дизайнерлік киімдерді ең төменгі бағамен сатып алудың
        бірегей мүмкіндігін береміз.
      </li>
    </ul>
    <h1 class="text-[20px] font-bold pt-[30px] pb-[10px]">САТУ МЕНЕДЖЕРЛЕРІ</h1>
    <div class="flex gap-[10px] flex-wrap">
      <div class="bg-[#F3F3F6] p-[25px] max-w-[380px]">
        <p class="name font-bold">Айгерим</p>
        <p class="prof text-[#bd9365] my-[20px] font-bold">Сату менеджері</p>
        <p class="phone">
          <span class="font-bold">+7 702 950 73 04</span>(Қазақстан үшін тегін)
        </p>
        <p class="phone mt-[20px]">
          <span class="font-bold">+7 702 950 73 06</span> (СНГ жәнеде басқа елді мекендер)
        </p>
      </div>
      <div class="bg-[#F3F3F6] p-[25px] max-w-[380px]">
        <p class="name font-bold">Асем</p>
        <p class="prof text-[#bd9365] my-[20px] font-bold">Сату менеджері</p>
        <p class="phone">
          <span class="font-bold">+7 702 950 73 05</span>(Қазақстан үшін тегін)
        </p>
        <p class="phone mt-[20px]">
          <span class="font-bold">+7 702 950 73 06</span> (СНГ жәнеде басқа елді мекендер)
        </p>
      </div>
      <div class="bg-[#F3F3F6] p-[25px] max-w-[380px]">
        <p class="name font-bold">Ару</p>
        <p class="prof text-[#bd9365] my-[20px] font-bold">Сату менеджері</p>
        <p class="phone">
          <span class="font-bold">+7 702 950 73 07</span>(Қазақстан үшін тегін)
        </p>
        <p class="phone mt-[20px]">
          <span class="font-bold">+7 702 950 73 06</span> (СНГ елдері)
        </p>
      </div>
    </div>
    <p class="pt-[20px] leading-[2]">
      Сіз біздің сату менеджерлеріміздің кем дегенде біреуінің дауысымен
      таныссыз. Өйткені, олар сіздің тапсырыстарыңыз бойынша толық ақпарат
      береді және уақтылы жөнелтуге қамқорлық жасайды. Беларуссиялық әйелдер
      трикотажына келетін болсақ, біздің менеджерлер бәрін біледі! Және бұл
      асыра сілтеу емес! Олар сізге әрдайым соңғы коллекциялар туралы айтып
      береді, қажетті мөлшерді таңдайды, тауардың болуы және жеткізудің мүмкін
      әдістері туралы ақпарат береді, тапсырыс беруге көмектеседі және сатып
      алуларыңыздың мүмкіндігінше тез жеткізілетініне көз жеткізеді.
    </p>
  </div>
</template>

<script>
export default {};
</script>

<style lang="scss" scoped>
.container {
  max-width: 1200px;
  margin: 0 auto;
}
@media (max-width: 570px) {
  ul {
    font-size: 15px;
  }
  h1 {
    font-size: 20px;
    text-align: center;
  }
}
</style>
